
######################################################################################################		
#接口名称: 商户管家业务订购关系                                                               
#接口编码：02065                                                                                          
#接口说明：本接口为日增量接口，首次上报订购状态为正常的全量订购关系
#程序名称: G_A_02065_DAY.tcl                                                                            
#功能描述: 生成02065的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110922
#问题记录：
#修改历史: 1. panzw 20110922	1.7.5 newly added
#修改历史: 1. panzw 20110927 无数据，暂报空
#######################################################################################################   
