
######################################################################################################		
#接口名称: 代理商信息                                                               
#接口编码：06038                                                                                          
#接口说明：记录代理商相关信息，代理商和其下属渠道是一对一或一对多的关系。
#程序名称: G_I_06038_DAY.tcl                                                                            
#功能描述: 生成06038的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110922
#问题记录：
#修改历史: 1. panzw 20110922	1.7.5 newly added 无数据，暂报空
#######################################################################################################   
