######################################################################################################
#接口名称：其它电信运营商
#接口编码：06015
#接口说明：记录与中国移动及其各个省级公司签订了合作服务协议的其它电信运营商的信息，
#          包括国内电信运营商和国际电信运营商。
#程序名称: G_I_06015_MONTH.tcl
#功能描述: 生成06015的数据
#运行粒度: 月
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：1.因为西藏电信运营商很少，目前也没有专门的表来维护这些信息，所以该接口参照
#          老系统的做法，直接插入几条数据。
#修改历史: 1.
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

        #本月 yyyymm
        set op_month [string range $optime_month 0 3][string range $optime_month 5 6]             
            
        #删除本期数据
        set handle [aidb_open $conn]
	set sql_buff "delete from bass1.g_i_06015_month where time_id=$op_month"
	if [catch { aidb_sql $handle $sql_buff } errmsg ] {
		WriteTrace "$errmsg" 2005
		aidb_close $handle
		return -1
	}
	aidb_commit $conn
	aidb_close $handle


        set handle [aidb_open $conn]
	set sql_buff "insert into bass1.g_i_06015_month values
                        ($op_month,'023101','中国联通拉萨分公司','023100','3','00010101','29991231','13101'),
                        ($op_month,'023102','中国联通日喀则分公司','023100','3','00010101','29991231','13102'),
                        ($op_month,'023103','中国联通山南分公司','023100','3','00010101','29991231','13103'),
                        ($op_month,'023104','中国联通林芝分公司','023100','3','00010101','29991231','13104'),
                        ($op_month,'023105','中国联通昌都分公司','023100','3','00010101','29991231','13105'),
                        ($op_month,'023106','中国联通那曲分公司','023100','3','00010101','29991231','13106'),
                        ($op_month,'023107','中国联通阿里分公司','023100','3','00010101','29991231','13107'),
                        ($op_month,'033101','中国电信拉萨分公司','023100','3','00010101','29991231','13101'),
                        ($op_month,'033102','中国电信日喀则分公司','023100','3','00010101','29991231','13102'),
                        ($op_month,'033103','中国电信山南分公司','023100','3','00010101','29991231','13103'),
                        ($op_month,'033104','中国电信林芝分公司','023100','3','00010101','29991231','13104'),
                        ($op_month,'033105','中国电信昌都分公司','023100','3','00010101','29991231','13105'),
                        ($op_month,'033106','中国电信那曲分公司','023100','3','00010101','29991231','13106'),
                        ($op_month,'033107','中国电信阿里分公司','023100','3','00010101','29991231','13107'),
                        ($op_month,'043102','中国网通日喀则分公司','023100','3','00010101','29991231','13102'),
                        ($op_month,'043103','中国网通山南分公司','023100','3','00010101','29991231','13103'),
                        ($op_month,'043106','中国网通那曲分公司','023100','3','00010101','29991231','13106'),
                        ($op_month,'053101','中国铁通拉萨分公司','023100','3','00010101','29991231','13101'),
                        ($op_month,'053102','中国铁通日喀则分公司','023100','3','00010101','29991231','13102'),
                        ($op_month,'053103','中国铁通山南分公司','023100','3','00010101','29991231','13103'),
                        ($op_month,'053104','中国铁通林芝分公司','023100','3','00010101','29991231','13104'),
                        ($op_month,'053105','中国铁通昌都分公司','023100','3','00010101','29991231','13105'),
                        ($op_month,'053106','中国铁通那曲分公司','023100','3','00010101','29991231','13106'),
                        ($op_month,'053107','中国铁通阿里分公司','023100','3','00010101','29991231','13107'),
                        ($op_month,'023100','中国联通西藏分公司','020000','2','00010101','29991231','13100'),
                        ($op_month,'033100','中国电信西藏分公司','030000','2','00010101','29991231','13100'),
                        ($op_month,'043100','中国网通西藏分公司','040000','2','00010101','29991231','13100'),
                        ($op_month,'053100','中国铁通西藏分公司','050000','2','00010101','29991231','13100')"
	if [catch { aidb_sql $handle $sql_buff } errmsg ] {
		WriteTrace "$errmsg" 2020
		puts $errmsg
		aidb_close $handle
		return -1
	}
	aidb_commit $conn
	aidb_close $handle

	return 0
}