
######################################################################################################		
#接口名称: 代理商下属社会渠道                                                               
#接口编码：06039                                                                                          
#接口说明：记录代销商与其下属社会实体渠道关联信息，以便按代理商统计业务量和酬金支付情况。
#程序名称: G_I_06039_DAY.tcl                                                                            
#功能描述: 生成06039的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110922
#问题记录：
#修改历史: 1. panzw 20110922	1.7.5 newly added 无数据，暂报空
#######################################################################################################   
