######################################################################################################
#接口名称：渠道统计月汇总1
#接口编码：22017
#接口说明：记录渠道统计的相关信息，其中"03  渠道类型编码"的如下维值必需提供（其它维值能上报则报）。
#程序名称: G_S_22017_MONTH.tcl
#功能描述: 生成22017的数据
#运行粒度: 月
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：1.
#修改历史: 1.
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

	return 0
}	