
######################################################################################################		
#接口名称: 垃圾短信监控平台短信拦截名单                                                               
#接口编码：22427                                                                                          
#接口说明：垃圾短信监控平台将实时拦截的短信记录通过CRM系统传到经营分析系统，以供经营分析系统进行被拦截用户的特征行为的分析。
#程序名称: G_S_22427_DAY.tcl                                                                            
#功能描述: 生成22427的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110811
#问题记录：
#修改历史: 1. panzw 20110811	1.7.4 newly added
#######################################################################################################   
