
######################################################################################################		
#接口名称: "已确认窜卡渠道名单"                                                               
#接口编码：22060                                                                                          
#接口说明："记录上月疑似窜卡渠道名单中的疑似窜卡渠道，本月确认为窜卡的渠道及用户情况。"
#程序名称: G_S_22060_MONTH.tcl                                                                            
#功能描述: 生成22060的数据
#运行粒度: MONTH
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110727
#问题记录：
#修改历史: 1. panzw 20110727	1.7.4 newly added
#######################################################################################################   
