
######################################################################################################		
#接口名称: 用户有效通信情况信息                                                               
#接口编码：21022                                                                                          
#接口说明：上报月末最后一天仍在网用户当月每日通信情况。
#程序名称: G_S_21022_MONTH.tcl                                                                            
#功能描述: 生成21022的数据
#运行粒度: MONTH
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20120605
#问题记录：
#修改历史: 1. panzw 20120605	中国移动一级经营分析系统省级数据接口规范 (V1.8.1) 
#######################################################################################################   
