
######################################################################################################		
#接口名称: 垃圾短信监控平台MO嫌疑黑名单                                                               
#接口编码：22423                                                                                          
#接口说明：垃圾短信监控平台根据监控策略实施MO短信话单监控输出的嫌疑黑名单。
#程序名称: G_S_22423_DAY.tcl                                                                            
#功能描述: 生成22423的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110811
#问题记录：
#修改历史: 1. panzw 20110811	1.7.4 newly added
#######################################################################################################   
