
######################################################################################################		
#接口名称: 用户使用终端WLAN上网情况                                                               
#接口编码：02048                                                                                          
#接口说明：记录用户使用终端进行WLAN上网的情况。
#程序名称: G_S_02048_MONTH.tcl                                                                            
#功能描述: 生成02048的数据
#运行粒度: MONTH
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20111128
#问题记录：
#修改历史: 1. panzw 20111128	1.7.7 newly added
#######################################################################################################   
