######################################################################################################
#接口名称：资费项
#接口编码：02029
#接口说明：由于资费项是由资费要素的编码组合而成，组合后的值很多，
#          各省仅上传本省资费营销案费率定义中使用到的资费项编码。
#程序名称: G_I_02029_MONTH.tcl
#功能描述: 生成02029的数据
#运行粒度: 月
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：1.
#修改历史: 1.
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

	return 0
}