
######################################################################################################		
#接口名称: 垃圾短信黑名单                                                               
#接口编码：22420                                                                                          
#接口说明：该接口为CRM系统经确认、维护的黑名单，传给经营分析系统，进行黑名单客户的分析、跟踪。
#程序名称: G_I_22420_DAY.tcl                                                                            
#功能描述: 生成22420的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110811
#问题记录：
#修改历史: 1. panzw 20110811	1.7.4 newly added
#######################################################################################################   
#“垃圾短信黑名单”表中的“用户标识”都应该在“用户”表中存在

