######################################################################################################
#接口名称：集团客户它网用户统计
#接口编码：01006
#接口说明：统计移动公司集团客户中收集到的使用它网电信业务的用户数。
#程序名称: G_I_01006_MONTH.tcl
#功能描述: 生成01006的数据
#运行粒度: 月
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：
#修改历史: 
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

	return 0
}