
######################################################################################################		
#接口名称: 经分系统识别高风险用户名单                                                               
#接口编码：22422                                                                                          
#接口说明：经营分析系统将生成的高风险用户名单传给CRM系统，由垃圾短信监控平台根据名单对疑似黑名单客户进行优先级过滤
#程序名称: G_I_22422_MONTH.tcl                                                                            
#功能描述: 生成22422的数据
#运行粒度: MONTH
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20111129
#问题记录：
#修改历史: 1. panzw 20111129	垃圾短信1.2 newly added
#######################################################################################################   
