######################################################################################################
#接口名称：智能网短信话单
#接口编码：04012
#接口说明：
#程序名称: G_S_04012_DAY.tcl
#功能描述: 生成04012的数据
#运行粒度: 日
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：
#修改历史: 
#######################################################################################################

proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

 	return 0
}