######################################################################################################
#接口名称：短号短信业务月使用
#接口编码：21019
#接口说明：记录集团短号短信业务的用户级计费量，包括对个人和对集团计费。
#程序名称: G_S_21019_MONTH.tcl
#功能描述: 生成21019的数据
#运行粒度: 月
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：1.
#修改历史: 1.
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

	return 0
}	