######################################################################################################
#接口名称：IP直通车话单
#接口编码：04001
#接口说明：IP直通车话单包括
#            1）固定电话绑定移动号码，拨打17951的话单
#            2）集团后付费固定电话拨打17951功能
#            这里的固定电话拨打17951均非实时扣费，而是采用后付费方式的用户话单。
#程序名称: G_S_04001_DAY.tcl
#功能描述: 生成04001的数据
#运行粒度: 日
#源    表：1.
#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：
#修改历史: 
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

	return 0

}