
######################################################################################################		
#接口名称: 自有增值业务先退费后查证月汇总                                                               
#接口编码：22090                                                                                          
#接口说明：采集自有增值业务“先退费，后查证”服务月报数据，区分包月业务和点播业务。
#程序名称: G_S_22090_MONTH.tcl                                                                            
#功能描述: 生成22090的数据
#运行粒度: MONTH
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20120507
#问题记录：
#修改历史: 1. panzw 20120507	中国移动一级经营分析系统省级数据接口规范 (V1.8.0) 
#######################################################################################################   
