
######################################################################################################		
#接口名称: 用户本地通话位置信息月汇总                                                               
#接口编码：22402                                                                                          
#接口说明："基于本地语音详单，对所有我网用户发生的通话按基站小区进行业务量汇总。注：不仅仅是校园基站。"
#程序名称: G_S_22402_MONTH.tcl                                                                            
#功能描述: 生成22402的数据
#运行粒度: MONTH
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110807
#问题记录：
#修改历史: 1. panzw 20110807	1.7.4 newly added & 暂缓接口
#######################################################################################################   
