######################################################################################################
#接口名称：智能网帐户号码分布情况
#接口编码：22042
#接口说明：记录智能网帐户号码的分布情况。
#程序名称: G_S_22042_MONTH.tcl
#功能描述: 生成22042的数据
#运行粒度: 月
#源    表：1.

#输入参数: 
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：王琦
#编写时间：2007-03-22
#问题记录：1.
#修改历史: 1.
#######################################################################################################
proc Deal { op_time optime_month province_id redo_number trace_fd bass1_dir temp_data_dir semi_data_dir final_data_dir conn conn_ctl src_data obj_data final_data } {

	return 0
}