
######################################################################################################		
#接口名称: 垃圾短信举报平台嫌疑黑名单                                                               
#接口编码：22428                                                                                          
#接口说明：该接口为10086999垃圾短信举报平台记录的用户举报记录，包含他省、其他运营商流转到本省的举报单。
#程序名称: G_S_22428_DAY.tcl                                                                            
#功能描述: 生成22428的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20110811
#问题记录：
#修改历史: 1. panzw 20110811	1.7.4 newly added
#######################################################################################################   
