
######################################################################################################		
#接口名称: 电子渠道终端销售信息                                                               
#接口编码：22095                                                                                          
#接口说明：记录江苏、广东电子渠道支撑相应省份终端销售统计信息
#程序名称: G_S_22095_DAY.tcl                                                                            
#功能描述: 生成22095的数据
#运行粒度: DAY
#源    表：1.
#输入参数: void
#输出参数: 返回值:0 成功;-1 失败
#编 写 人：panzw
#编写时间：20120507
#问题记录：
#修改历史: 1. panzw 20120507	中国移动一级经营分析系统省级数据接口规范 (V1.8.0) 
#######################################################################################################   
